/* Даны две точки, а с координатами x1, y1 и точка b с координатами x2, y2.
   Определить какая из этих точек ближе к началу координат */
#include <iostream>
#include <locale.h>
#include <math.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "RUS");
	float x1, y1, x2, y2, d, d1;
	cout << "Введите координаты точки a ";
	cin >> x1 >> y1;
	cout << "\nВведите координаты точки b ";
	cin >> x2 >> y2;
	d = sqrt(pow(0 - x1, 2) + pow(0 - y1, 2));		//вычисление расстояния от начала координат до точки a
	d1 = sqrt(pow(0 - x2, 2) + pow(0 - y2, 2));		//вычисление расстояния от начала координат до точки b
	if (d > d1) {
		cout << "\nПри координатах точки a x1 = " << x1 << "; y1 = " << y1;
		cout << "\nПри координатах точки b x2 = " << x2 << "; y1 = " << y2;
		cout << "\nТочка b находится ближе к началу координат";
	}
	else if (d == d1) {
		cout << "\nПри координатах точки a x1 = " << x1 << " y1 = " << y1;
		cout << "\nПри координатах точки b x2 = " << x2 << " y1 = " << y2;
		cout << "\nТочка a и b находится на одинаковом расстоянии от начала координат";
	}
	else {
		cout << "\nПри координатах точки a x1 = " << x1 << " y1 = " << y1;
		cout << "\nПри координатах точки b x2 = " << x2 << " y1 = " << y2;
		cout << "\nТочка a находится ближе к началу координат";
	}
}